Config/DataProcessors/FillRoomPropertiesWizard.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>FillRoomPropertiesWizard</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Hotel</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Hotels</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Rooms</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Room</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Rooms</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>RoomProperties</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>RoomProperty</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.RoomProperties</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Config/DataProcessors/FillRoomPropertiesWizard/Forms/tcForm/Ext/Form/Module.bsl
&AtServer
Procedure OnCreateAtServer(pCancel, pStandardProcessing)
	Object.Hotel = SessionParameters.CurrentHotel;	
EndProcedure

&AtClient
Procedure HotelClearing(pItem, pStandardProcessing)
	If Not CheckHotelViewAccess() Then
		pStandardProcessing = False;
	EndIf;
EndProcedure

&AtServerNoContext
Function CheckHotelViewAccess()
	Return AccessRight("View", Metadata.Catalogs.Hotels);
EndFunction

&AtClient
Procedure RoomsChoiceProcessing(pItem, pSelectedValue, pStandardProcessing)
	pStandardProcessing = False;
	RoomsChoiceProcessing_AtServer(pSelectedValue);
EndProcedure

&AtServer
Procedure RoomsChoiceProcessing_AtServer(pSelectedValue)
	If ValueIsFilled(pSelectedValue) And 
		TypeOf(pSelectedValue) = Type("CatalogRef.Rooms") And 
		Not pSelectedValue.IsFolder Then
		If Object.Rooms.FindRows(New Structure("Room", pSelectedValue)).Count() = 0 Then
			vRow = Object.Rooms.Add();
			vRow.Room = pSelectedValue;
		EndIf;
	EndIf;
EndProcedure

&AtClient
Procedure ChooseRoomsAction(pCommand)
	vParams 				= New Structure("ChoiceMode, Filter");
	vParams.ChoiceMode		= True;
	If ValueIsFilled(Object.Hotel) Then
		vParams.Filter		= New Structure("Owner", Object.Hotel);
	EndIf;
	vForm 					= GetForm("Catalog.Rooms.ChoiceForm", vParams, Items.Rooms, ThisForm);
	vForm.CloseOnChoice 	= False;
	vForm.CloseOnOwnerClose = True;
	vForm.WindowOpeningMode = FormWindowOpeningMode.LockOwnerWindow; 
	vForm.Open();
EndProcedure

&AtServer
Procedure FormExecuteAtServer()
	vObj = FormAttributeToValue("Object", Type("DataProcessorObject.FillRoomPropertiesWizard"));
	vObj.pmExecute();
EndProcedure

&AtClient
Procedure FormExecute(pCommand)
	FormExecuteAtServer();
	ShowMessageBox(, NStr("en='Done!'; ru='Выполнено!'; de='Fertig!'"));
EndProcedure
